---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalBusData.TotalConnectedCurrent
source: html/28faea4d-06e4-9da0-c644-e07d535b535a.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalBusData.TotalConnectedCurrent Property

The total connected current of the analytical bus.

## Syntax (C#)
```csharp
public double TotalConnectedCurrent { get; }
```